import { type Metadata } from 'next';

import { TF_YEAR, TUES_AGE } from '@/constants/event';

import { AboutPageContent } from './about-page-content';

export const metadata = {
	title: 'За ТУЕС',
	description: `Научете повече за най-доброто училище в България - Технологично училище "Електронни системи", което през ${TF_YEAR} беше с втори най-висок бал за страната. ТУЕС е училище с ${TUES_AGE} години история, което е специализирано в областта на ИТ и единствено в България подготвя специалисти в областта на системно програмиране.`,
	keywords: [
		'туес',
		'туес фест',
		`туес фест ${TF_YEAR}`,
		'технологично училище електронни системи',
		'технологично',
		'училище',
		'електронни',
		'системи',
		`туес ${TF_YEAR}`,
		'кандидатстване',
		'училища софия',
		'училища',
		'софия',
		'софия туес',
		'най-добро училище',
		'най-добро училище в българия',
		'най-добро училище в софия',
		'висок бал',
		'елитно училище',
		'елитно',
		'училище в софия',
		'минимален бал',
		'минимален бал за туес',
		'минимален бал софия',
	],
} satisfies Metadata;

export default function AboutPage() {
	return <AboutPageContent />;
}
