import { type Metadata } from 'next';

import { TF_YEAR } from '@/constants/event';

import { ApplyPageContent } from './apply-page-content';

export const metadata = {
	title: 'Кандидатстване в ТУЕС',
	description:
		'Научете как може да кандидатствате в ТУЕС след НВО на 7ми клас в ТУЕС - Технологично училище "Електронни системи"',
	keywords: [
		'туес',
		'туес фест',
		'кандидатстване',
		'калкулатор',
		'калкулатор на бал',
		'изчисли бал',
		`изчисли бал ${TF_YEAR}`,
		'изчисли си бала',
		`изчисли си бала ${TF_YEAR}`,
		`изчисли бал ${TF_YEAR} туес`,
		'кандидатстване в туес',
		`кандидатстване в туес ${TF_YEAR}`,
		'нво',
		`нво ${TF_YEAR}`,
		`нво ${TF_YEAR} туес`,
		'матури',
		`матури ${TF_YEAR}`,
		'матури 7ми клас',
		'матури 7 клас',
		`матури ${TF_YEAR} туес`,
		'матури 7ми клас туес',
		'матури 7 клас туес',
		'седми клас',
		'седми клас туес',
		'осми клас',
		'гимназия',
		'гимназии',
		'топ гимназии',
		`топ гимназии ${TF_YEAR}`,
		'топ училища',
		`топ училища ${TF_YEAR}`,
		'софия',
		'софия туес',
		'минимален бал',
		'минимален бал туес',
		'висок бал',
		'най-висок бал',
	],
} satisfies Metadata;

export default function ApplyPage() {
	return <ApplyPageContent />;
}
